// ConsoleApplication20.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <Windows.h>
using namespace std;


int main()
{
    setlocale(LC_ALL, "");

    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    // Составьте программу, выводящую на экран квадраты чисел от 10 до 20.
    /*
    int a = 10;
    if (a <= 20) {
       cout << a * a << endl;
       a++;
    }
    */
    // Составьте программу, которая вычисляет сумму чисел от 1 до n.значение n вводится с клавиатуры.
   /*
     int n;
     cin >> n;
     cout << n * (n + 1) / 2;

     int n;
     int sum = 1;
     cin >> n;
     for (int i = 1; 1 <= n; i++){

     }
     cout << sum;

     */
     // С клавиатуры вводятся n чисел.Составьте программу, которая определяет кол - во отрицательных, кол - во положительных и кол - во нулей среди введенных чисел.Значение n вводится с клавиатуры.





}